<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;

use App\Models\Book;
use App\Models\User;
use App\Models\BookUser;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        User::create([
            'last_name' => 'Болдбаатар',
            'first_name' => 'Мөнх-Оргил',
            'email' => 'm_orgilmn@yahoo.com',
            'password' => Hash::make('12345678'),
            'role' => 2,
        ]);
        User::create([
            'last_name' => 'Мөнхжаргал',
            'first_name' => 'Тэмүүлэн',
            'email' => 'antedace50@gmail.com',
            'password' => Hash::make('12345678'),
            'role' => 2,
        ]);

        Book::create([
            'title' => 'Миний мэдэх Язид ба Зинедин Зидан',
            'description' => 'Дэлхийн хаан спорт хөлбөмбөгийн домогт тамирчин Зинедин Зиданы амьдрал, тоглогчийн карьер, дасгалжуулагчийн түүхэн замналын тухай энэхүү номд өгүүлэх болно. Зинедин Зидан нь 1998 оны ДАШТ-ний алтан медал, ballon\'dor-ын шагнал, 2000 оны ЕАШТ-ний алтан медаль, Аваргуудын лигийн түрүү зэрэг тамирчин хүний хүртэж болох бүхий л цомыг өргөхөөс гадна дасгалжуулагчаар ажилласан даруйдаа Реал Мадрид клубтэйгээ хамт дараалан 3 удаа түрүүлж түүхэн амжилтыг бүтээсэн Францын нэр сүр болсон домогт тамирчин билээ.',
            'author' => 'Жан-Мишель Александр',
            'picture' => 'pictures/1.png',
            'published_date' => '2021-05-12',
            'page_count' => '165',
            'remaining_count' => '100',
        ]);
        Book::create([
            'title' => 'Хэрхэн илүү үр дүнтэй бодох вэ?',
            'description' => 'Зарим үед бид гайхамшигтай саруул, бүтээлчээр боддог бол бусад үед бидний санаа бодол хүлээстэй, улиг болсон, бүр тэнэг ч юм шиг санагдах нь бий. Хэдий бидний амьдралд сайн сайхан ахиц дэвшил гарах эсэх нь оюун ухаан маань бүрэн хүчин чадлаараа ажиллах эсэхтэй шууд хамааралтай ч, бид бодлынхоо чанарыг удирдах, нөлөөлөх арга зам байдаггүй гэж санадаг. Бид оюун ухааныхаа ажиллаж буй үйл явцад анхаарал хандуулж, хамгийн шилдгээр нь ажиллахад зориулсан оюуны дасгал хийснээр бодох чадвараа сайжруулж чадна. Энэхүү номд оюун ухааны тань илүү сайн талыг олж нээх, оюун ухаан дээд цэгтээ ажиллах үеийг анзаарч, танин мэдэх дасгалууд бий. Сэтгэлд таатай, шаардлагатай бодлуудаа гэнэт ухан самгардах бус, системтэйгээр ургацаа хураах мэт хурааж сурах нь зүйтэй',
            'author' => 'The School of life',
            'picture' => 'pictures/2.png',
            'published_date' => '2022-02-27',
            'page_count' => '273',
            'remaining_count' => '100',
        ]);
        Book::create([
            'title' => 'Иогийн сурах бичиг',
            'description' => 'Хүн болгон иогчин байдаг. Бид тэр чадварыг нь сэрээж өгдөг бөгөөд үүнийг багшийн удирдлага дор хэн ч сурах бүрэн боломжтой. Энэхүү “Иогийн сурах бичиг”-т “Сохам Аюур Иог Ашрам болон “Карма иог студи”-ийн хамтын ажиллагааны хүрээнд зохиогчийн албан ёсны эрхтэйгээр “Карма иог студи”-ээс орчуулан, эмхэтгэж эрхэм уншигч Та бүхэнд толилуулж байна.',
            'author' => 'Шри Сохам',
            'picture' => 'pictures/3.png',
            'published_date' => '2021-02-24',
            'page_count' => '309',
            'remaining_count' => '100',
        ]);
        Book::create([
            'title' => 'Хөгжмийн эгшиг',
            'description' => 'Хувь заяаны эрхээр хайрт бүсгүйнхээ гэр бүлийг даган харийн орныг зорин эх нутгаасаа, элгэн саднаасаа холдон одсон залуу хүү амьдралын эргүүлэг нугачаанд сөхөрч бүдэрсээр, тэмцэн боссоор, эх орноосоо улам бүр холдон холдсоор... Харийн оронд амьдралынхаа дийлэнх хугацааг өнгөрөөсөн ч түүний сэтгэл зүрхэнд Монгол хэмээх нэгэн нэр үүрд мөнхийн хадагдаастай, эх орных нь, элгэн садных нь тухай бодол зүрх сэтгэлд нь мөнхөд уяастай... Насны наран жар хэдийн хэвийсэн хойно түүнд эх нутгийнхаа ариун хөрсөн дээр хөл тавьж, элэг нэгтнүүдтэйгээ учран золгох хувь тохионо. Чухам энэ л үед түүнийг амраг хайрт бүсгүйнх нь уянгалуулан эгшиглүүлдэг байсан тэрхүү “Хөгжмийн эгшиг” угтан золгох хувь ерөөлтэй байжээ...',
            'author' => 'Ж.Пүрэв',
            'picture' => 'pictures/4.png',
            'published_date' => '2015-10-21',
            'page_count' => '314',
            'remaining_count' => '100',
        ]);
        Book::create([
            'title' => 'Үүсгэн байгуулагч',
            'description' => 'Үүсгэн байгуулагчид бол өнөөгийн амьдралд хүчирхэг, тогтвортой үр нөлөөгөө үзүүлсэн бүтээгдэхүүн, бүтээлч байдал, давталтын түүх билээ. Энэ түүх бол авьяастнууд нэг дор цугларсан ховорхон тохиол, тэр нь дэлхий ертөнцийг хэрхэн өөрчилснийг зурагласан хүүрнэл юм.',
            'author' => 'Жимми Сони',
            'picture' => 'pictures/5.png',
            'published_date' => '2022-07-04',
            'page_count' => '189',
            'remaining_count' => '100',
        ]);
        Book::create([
            'title' => 'Мянган захидал',
            'description' => 'ХХ зууны нэрт романч тѳрийн шагналт зохиолч Ж.Пүрэвийн "Мянган захидал" роман шинээр хэвлэгдлээ. Багш шавийн хоорондын дотно харилцаа, олон замаар салан одсон шавь нарынх нь ѳдѳр бүр илгээх захидал нэг түүхийг ѳгүүлэх нь юутай сонин.Багш бүсгүй Мягмарын залуу насны хайр дурлал, алдаа оноо, амьдралын түмэн нугачааг туулж яваа шавь нарынх нь сэтгэлийн хүүрнэлүүд энэ зохиолыг олон талтай баялаг болгожээ.',
            'author' => 'Ж.Пүрэв',
            'picture' => 'pictures/6.png',
            'published_date' => '2019-12-19',
            'page_count' => '201',
            'remaining_count' => '100',
        ]);
        Book::create([
            'title' => 'Бүгдээрээ найз биш юм уу?',
            'description' => 'Сэтгэл догдлуулсан түүхүүд Сэтгэл зүйн тайллууд',
            'author' => 'А.Энхцэцэг',
            'picture' => 'pictures/7.png',
            'published_date' => '2021-03-01',
            'page_count' => '316',
            'remaining_count' => '100',
        ]);
        Book::create([
            'title' => 'Монголо гэдэг эрхэм',
            'description' => 'АНОД банкны эзэн асан Н.Даваагийн амьдрал бол 1990-ээд оноос хойш бизнес эрхэлж амжилтад хүрсэн ч улс төрийн шалтгаанаар банкаа алдаж, хилс хэрэгт яллагдаж хоригдсон ч монголоо гэдэг сэтгэлээр хөдөлмөрлөж одоо АНУ-ын Тесла, Японы Мацүшита корпорацитай холбогдон өөрсдийн олж, бүтээсэн шинэ тенхологио танилцуулан ажиллаж буй эрхэм юм.',
            'author' => 'Д.Төрмөнх',
            'picture' => 'pictures/8.png',
            'published_date' => '2021-04-14',
            'page_count' => '182',
            'remaining_count' => '100',
        ]);
    }
}
